import math

# =========================
# 模型路径
# =========================
MODEL_PATH = "/root/models/gcmodel/model_272201.mud"

# =========================
# YOLO参数
# =========================
CONF_TH = 0.5
IOU_TH = 0.45

# =========================
# 类别（只保留圆环）
# =========================
CLASS_RING = 1

# =========================
# 图像尺寸
# =========================
IMAGE_WIDTH = 224
IMAGE_HEIGHT = 224

CENTER_X = IMAGE_WIDTH // 2
CENTER_Y = IMAGE_HEIGHT // 2

# =========================
# 参考点（放置修正点）
# =========================
REF_X = 0      # 像素偏移（右为正）
REF_Y = 0      # 像素偏移（上为正）

# 最终参考点 = (CENTER_X + REF_X, CENTER_Y - REF_Y)

# =========================
# STM32通信
# =========================
UART_PORT = "/dev/ttyS0"
UART_BAUD = 115200

# =========================
# 限幅（防止异常值）
# =========================
DX_LIMIT = 45
DY_LIMIT = 35

# =========================
# 到位阈值（核心）
# =========================
STOP_DIST_THRESHOLD = 6   # 像素距离，小于认为已对准

# =========================
# 滤波
# =========================
FILTER_ALPHA = 0.75

# =========================
# 通信协议
# =========================
PROTOCOL_HEADER = 0xAA
PROTOCOL_TAIL = 0x55

MODE_NONE = 0x00     # 无目标 / 已完成
MODE_RING = 0x02     # 圆环对准中